% function [y] = a1_9(x)
% syms r
% r=1000/713;
% y = ( r*exp(-1*r*x).*(x>0) )  + ( 0.*(x<=0) );
% end
% % fplot(@a1_9,[-10,10],'g');grid on
% %调用函数，记得更改r的值
clc;
% syms r
% r=1000/713;
% y = ( r*exp(-1*r*x).*(x>0))+(0.*(x<=0));
% plot(x,y,[-10,10],'r');
% hold on;
% r=500/713;
% y = ( r*exp(-1*r*x).*(x>0))+(0.*(x<=0));
% plot(x,y,[-10,10],'g');
% hold on;
% r=400/713;
% y = ( r*exp(-1*r*x).*(x>0))+(0.*(x<=0));
% plot(x,y,[-10,10],'b');
% hold on;
% r=100/713;
% y = ( r*exp(-1*r*x).*(x>0))+(0.*(x<=0));
% plot(x,y,[-10,10],'m');
% hold on;
% ylim([-0.1,1.6]);
% grid on
% fplot(y,[-10,10],'r');

% plot(x,y,[-10,10],'r');
% hold on;
% r=500/713;
% y = ( r*exp(-1*r*x).*(x>0))+(0.*(x<=0));
% plot(x,y,[-10,10],'g');
% hold on;
% r=400/713;
% y = ( r*exp(-1*r*x).*(x>0))+(0.*(x<=0));
% plot(x,y,[-10,10],'b');
% hold on;
% r=100/713;
% y = ( r*exp(-1*r*x).*(x>0))+(0.*(x<=0));
% plot(x,y,[-10,10],'m');
% hold on;
% ylim([-0.1,1.6]);
% grid on
syms r
hold on;
r=1000/713;
fplot(@(x)(r*exp(-1*r*x).*(x>0))+(0.*(x<=0)),[-10,10],'r');
r=500/713;
fplot(@(x)(r*exp(-1*r*x).*(x>0))+(0.*(x<=0)),[-10,10],'g');
r=400/713;
fplot(@(x)(r*exp(-1*r*x).*(x>0))+(0.*(x<=0)),[-10,10],'b');
r=100/713;
fplot(@(x)(r*exp(-1*r*x).*(x>0))+(0.*(x<=0)),[-10,10],'m');
ylim([-0.1,1.6]);
grid on;
